# SQL

In [1]:
%load_ext sql

Found pyproject.toml from '/Users/adam/@/jupyter-codespace'

In [2]:
%sql sqlite:///data/db.sqlite

Use `%%` for multi-line statements.

In [3]:
%%sql
DROP TABLE IF EXISTS languages;
CREATE TABLE languages (name, rating, change);
INSERT INTO languages VALUES ('Python', 14.44, 2.48);
INSERT INTO languages VALUES ('C', 13.13, 1.50);
INSERT INTO languages VALUES ('Java', 11.59, 0.40);
INSERT INTO languages VALUES ('C++', 10.00, 1.98);

Running query in 'sqlite:///data/db.sqlite'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

In [4]:
%sql SELECT * FROM languages;

Running query in 'sqlite:///data/db.sqlite'

+--------+--------+--------+
|  name  | rating | change |
+--------+--------+--------+
| Python | 14.44  |  2.48  |
|   C    | 13.13  |  1.5   |
|  Java  | 11.59  |  0.4   |
|  C++   |  10.0  |  1.98  |
+--------+--------+--------+